title: Windows scheduled task create shell
id: a250b79a-fd55-46e9-b7bf-4af6dbf28c6e
status: test
description: Adversaries frequently establish persistence by using scheduled tasks to launch the Windows Command Shell
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Linhnvhdev
date: 2023/08/29
tags:
    - attack.t1059.003
logsource:
    product: windows
detection:
    selection:
        Image|endswith: 'schtasks.exe'
        CommandLine|contains:
            - 'create'
            - 'cmd.exe /c'
            - 'cmd /c'
    condition: selection
falsepositives:
    - medium
level: medium