title: PowerShell Encodedcommand  Switch
id: dec520d9-638f-4646-89dc-f60f0900390b
status: experimental
description: This detection analytic looks for the execution of powershell.exe with command lines that include variations of the -encodedcommand argument
author: linhnvhdev
date: 2023/08/29
references:
    - https://redcanary.com/threat-detection-report/techniques/powershell/
tags:
    - attack.t1059.001
logsource:
    product: windows
detection:
    selection:
        Image|endswith: 'powershell.exe'
        CommandLine|contains:
            - '-e'
    filter:
        CommandLine|contains:
            - '-exec'
    condition: selection and not filter
falsepositives:
     - Unknown
level: critical
