title: Suspicious PowerShell Cmdlets

id: 95651816-0f9e-4234-880a-1e3b27ea8320
status: experimental
description: detection analytics look for cmdlets, methods, and switches that may indicate malicious activity
author: linhnvhdev
date: 2023/08/29
references:
    - https://redcanary.com/threat-detection-report/techniques/powershell/
tags:
    - attack.t1059.001
logsource:
    product: windows
    service: security
detection:
    selection:
        Image|endswith: 'powershell.exe'
        CommandLine|contains:
            - '-nop'
            - 'noni'
            - 'invoke-expression'
            - 'iex'
            - '.downloadstring'
            - 'downloadfile'
    condition: selection
falsepositives:
     - Unknown
level: critical
