title: Bypassing security controls

id: a250b79a-fd55-46e9-b7bf-4af6dbf28c6e
status: test
description: detect Adversaries bypass controls
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Linhnvhdev
date: 2023/08/29
tags:
    - attack.t1059.003
logsource:
    product: windows
detection:
    selection:
        Image|endswith: 'cmd.exe'
        CommandLine|contains:
            - 'bypass'
            - '-exec'
    condition: selection
falsepositives:
    - medium
level: medium