title: Unusual or suspicious process ancestry

id: 51ad7fa9-17b9-4245-a939-adae9e710380
status: test
description: detect a diverse array of malicious activity related to web server compromises
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Linhnvhdev
date: 2023/08/29
tags:
    - attack.t1059.003
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: 'cmd.exe'
        ParentImage|endswith: 'w3wp.exe'
        CommandLine|contains:
            - 'http://' # captures both http and https
            - 'https://'
            - 'echo'
    other:
        Image|endswith: 'powershell.exe'
        ParentImage|endswith: 'cmd.exe'
    condition: selection or other
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - medium
level: medium