title: Windows Scheduled Task Create Shell

id: 91c47440-2a3a-4cb8-a1f2-37bd75d7f4fa
status: test
description: Adversaries frequently establish persistence by using scheduled tasks to launch the Windows Command Shell
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Linhnvhdev
date: 2023/08/29
tags:
    - attack.t1059.003
logsource:
    product: windows
    service: security
detection:
    selection:
        Image|endswith: 'schtasks.exe'
        CommandLine|contains:
            - 'create'
            - 'cmd.exe /c'
            - 'cmd /c'
    condition: selection
falsepositives:
    - Unknown
level: medium