title: Windows Explorer Spawn Start And Exit Command

id: 127bd585-ec81-4de1-b8f7-4b022a73acd5
status: test
description: Looks for instances of explorer.exe spawning cmd.exe along with corresponding start and exit commands that we commonly observe in conjunction with a wide variety of malicious activity.
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Linhnvhdev
date: 2023/08/29
tags:
    - attack.t1059.003
logsource:
    product: windows
    service: security
detection:
    selection:
        Image|endswith: 'cmd.exe'
        ParentImage|endswith: 'explorer.exe'
        CommandLine|contains|all:
            - 'start'
            - 'exit'
    condition: selection
falsepositives:
    - Unknown
level: medium