title: Service Control Manager Spawning Suspect Strings

id: 5550d1df-d1a8-4369-97f4-f9a34ffe03bc
status: test
description: Service Control Manager spawning Command Shell with suspect strings
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Linhnvhdev
date: 2023/08/29
tags:
    - attack.t1059.003
logsource:
    product: windows
    service: security
detection:
    selection:
        Image|endswith: 'cmd.exe'
        ParentImage|endswith: 'services.exe'
        CommandLine|contains:
            - '/c'
            - 'echo'
    condition: selection
falsepositives:
    - Unknown
level: informational