title: Service Control Manager spawning Command Shell with suspect strings

id: 127bd585-ec81-4de1-b8f7-4b022a73acd5
status: test
description: Service Control Manager spawning Command Shell with suspect strings
references:
    - https://redcanary.com/threat-detection-report/techniques/windows-command-shell/
author: Linhnvhdev
date: 2023/08/29
tags:
    - attack.t1059.003
logsource:
    product: windows
detection:
    selection:
        Image|endswith: 'cmd.exe'
        ParentImage|endswith: 'explorer.exe'
        CommandLine|contains|all:
            - 'start'
            - 'exit'
    condition: selection
falsepositives:
    - medium
level: medium